In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

__Before Feature Construction__

In [19]:
df=pd.read_csv(r"D:\Machine Learning\ML-Learning-Projects\1_UnderstandingData\Titanic-Dataset.csv",usecols=['Age','Pclass','SibSp','Parch','Survived'])

In [22]:
df.sample(5)

     Survived  Pclass   Age  SibSp  Parch
884         0       3  25.0      0      0
662         0       1  47.0      0      0
500         0       3  17.0      0      0
845         0       3  42.0      0      0
128         1       3   NaN      1      1

In [24]:
df.dropna(inplace=True)

In [28]:
X = df.iloc[:,1:5]
y = df['Survived']
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.6933333333333332

__Applying feature construction__

In [33]:
df['Family_size']=df['SibSp']+df['Parch']

In [39]:
df.sample(5)

     Survived  Pclass   Age  SibSp  Parch  Family_size
583         0       1  36.0      0      0            0
248         1       1  37.0      1      1            2
690         1       1  31.0      1      0            1
79          1       3  30.0      0      0            0
141         1       3  22.0      0      0            0

In [41]:
def myfunc(num):
    if num==1:
        return 0
     elif num>1 and num<=4:
        return 1
    else:
        return 2

In [45]:
df['family_type']=df['Family_size'].apply(myfunc)

In [47]:
df.drop(columns=['SibSp','Parch','Family_size'],inplace=True)

In [49]:
df.head()

   Survived  Pclass   Age  family_type
0         0       3  22.0            0
1         1       1  38.0            0
2         1       3  26.0            2
3         1       1  35.0            0
4         0       3  35.0            2

In [55]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.6933333333333332

__Feature Selection__

In [58]:
df=pd.read_csv(r"D:\Machine Learning\ML-Learning-Projects\1_UnderstandingData\Titanic-Dataset.csv")

In [60]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
df['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [74]:
df['Title']=df['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [76]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr